// кр.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <Windows.h>

using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

   

   /* float a = 3.45, b = 5.04;
    int c,d;
    cout << "Выберете формат 9х12(1) - цена 3,45 руб/шт или 10х15(2) - цена 5,04 руб/шт ";
    cin >> c;
    cout << endl << "Выберете кол-во фотографий ";
    cin >> d;

    if (c == 1) {
        if (d >= 10) {
            cout << "Цена: " << a * d - a * d * 5 / 100;
        }
        else {
            cout << "Цена: " << a * d;
        }
    }
    else if (c == 2) {
        if (d >= 10) {
            cout << "Цена: " << b * d - b * d * 5 / 100;
        }
        else {
            cout << "Цена: " << b * d;
        }
    }*/





   /* float I, P, U;
    cin >> P >> U;
    if (U == 0) {
        cout << "Делитель равен нулю";
    }
    else
        cout << "Сила тока равна - " << P / U;*/

    //int a,b,c,d=3,f=6,g=10,summ;
    //cout << "Выберете материал: пластик(1) - 3 руб/см^2, текстиль(2) - 6 руб/см^2, алюмиинй(3) - 10 руб/см^2 ";
    //cin >> a;
    //cout << "Укажите длинну - ";
    //cin >> b;
    //cout << "Укажите ширину - ";
    //cin >> c;
    //switch (a) {
    //case(1):
    //    summ = b * c * d;
    //case(2):
    //    summ = b * c * g;
    //case(3):
    //    summ = b * c * f;
    //}
    //cout << "Цена - " << summ;



    //float a, c=0;
    //int b;
    //cin >> a;
    //cout << endl;
    //cin >> b;
    //switch (b) {
    //case 1:
    //    cout <<  a + a * 9 / 100;
    //    break;
    //case 2:
    //    cout << a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100;
    //    break;
    //case 3:
    //    cout << a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 + a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100;
    //    break;
    //case 4 :
    //    cout << a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100 + (a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 + a + a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100) * 15 / 100;
    //    break;
    //case 5:
    //    cout << a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100 + (a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 + a + a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100) * 15 / 100 + (a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100 + (a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100) * 15 / 100) * 18 / 100;
    //    break;
    //case 6:
    //    cout << a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100 + (a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 + a + a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100) * 15 / 100 + (a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100 + (a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100) * 15 / 100) * 18 / 100 + (a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 + a + a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100 + (a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100) * 15 / 100 + (a + a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 + a + a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100 + (a * 9 / 100 + (a + a * 9 / 100) * 11.5 / 100 +  a * 9 / 100 + ((a + a * 9 / 100) * 11.5 / 100) * 13.5 / 100) * 15 / 100) * 18 / 100) * 24 / 100;
    //    break;
    //    
    //}
    



        //for (int i = 0; i < 10; i++) {
        //    if (i % 2 != 0) {
        //        cout << i << "    " << i * i << endl;
        //    }
        //}




    //float a,summ=0,sr,c=0;
    //cin >> a;
    //while (a != 0) {
    //    c += 1;
    //    if (a > 0)
    //        summ += a;
    //    cin >> a;

    //}
    //cout << summ << " " << summ / c;


   /* int i = 2, a, c = 0;
    cin >> a;
    cout << endl;
    while (i < a) {
        if (a % i == 0)
            c++;
        i++;
    }
    if (c == 0)
        cout << "Число простое";
    else
        cout << "Число не простое";*/



    

}


